ERP DEV.WMS/src/Documents/вмс_ПроверкаКомплектности/вмс_ПроверкаКомплектности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вмс_ПроверкаКомплектности</name>
  <registerRecords>AccumulationRegister.вмс_ПотребностьКомплектов</registerRecords>
  <registerRecords>AccumulationRegister.вмс_ПотребностьКомплектующих</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплекты</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаТовара</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>ИдентификаторСтрокиКомплекта</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующая</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаКомплектующей</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP DEV.WMS/src/Documents/вмс_ПроверкаКомплектности/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура КомплектыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КомплектыПриАктивизацииСтроки(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Комплекты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Элементы.Комплектующие.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиКомплекта", Элементы.Комплекты.ТекущиеДанные.ИдентификаторСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	НайденныеСтроки = Объект.Комплектующие.НайтиСтроки(Новый Структура("ИдентификаторСтрокиКомплекта", Элемент.ТекущиеДанные.ИдентификаторСтроки));
	вмс_РаботаСКоллекциями.УдалитьЭлементыКоллекции(Объект.Комплектующие, НайденныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПослеУдаления(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Элементы.Комплекты.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ИдентификаторСтрокиКомплекта = Элементы.Комплекты.ТекущиеДанные.ИдентификаторСтроки;
	КонецЕсли;
КонецПроцедуры
